name: "deep_sequence_rec"
platform: "onnxruntime_onnx"
max_batch_size: 64

input [
  {
    name: "input_sequences"
    data_type: TYPE_INT64
    dims: [ 50 ]
  }
]
output [
  {
    name: "output_logits"
    data_type: TYPE_FP32
    dims: [ 5000 ]
  }
]

dynamic_batching {
  max_queue_delay_microseconds: 2000
  preferred_batch_size: [ 8, 16, 32, 64 ]
}

instance_group [
  {
    count: 2
    kind: KIND_GPU
  }
]
